node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7982209
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\366s.>T\217\"\276!\221\274\274^\034\234\274\245Q\200\276?\237&>\357w\270\275\271\235\005=%N(;o\216\275=\237w\220=\213 ,\276\0274\021>\026\362\237\273\337\303/\275\364\331\004\276\221\360\026>\217\356\"\276\215\010Z=\271A\364=\352(\016>\352\257U\274\271\334<>_U\376\275/\310\342\275v\222}=\207,\n>\r\361\363<\"\220\005\276Nq\264<\214\207\014\276\207\261\241<(|\226=\306_\317=\277\2417;t%G\275h\335\231\276\2247`\275\352!y\274G\245O>\235\032\031>\370F\364<&\n=\276{\007\212\276\242P\365\275\016\213`=\222\202\217>\"2\t=\273\'1>\355\243A\2768\\o\275\221\214)\2732O>\273\341{n\276H.\252\275\221\362\210=\006\2335\276\254\240\177=\220\374\322\275\205\317\265\274\355\341,\276no\305\275\374\014\367\275Qxn\274\272\276\311\274\271>x\276\343\332\'\275\315FK;\376\354\030\276s\'*\276\0061\000\276\272\276\353<Wy\355\275\033=\002>\332\004\2479h\220i>\260\203\013\276\204\337\222\276\274\242\355\275\005\212^\275&\353\362=\256\224H\275CE\254\275\275\026\'>\276\343\313\275\336\2522\276\243L\335\275hAJ>q/\235=<\000\367\275\027\274\032\275\323 ><\010\357%>\026X\r>\000C\275<Ag \276\272\"\253=svR>\035\227\201\276\010\216\t=\330\034\"<\235L\013\275\"\342\366\274\200\373\343\275\333\t\t\275[\222\237\275\277\273\343;c\347A=\2432\304=\377Y\374\275\277\357>\275\307\374/=\267Q\343\275\3173\213\275SV8\275\366\0325\276{N\327\275\254/j>\003\256\203;I|\247\276\210\234R\276\236\272<\276Q\0252>\203m\021\276*\347\252\275Hd\232=\367\341Y=\201S\364\275\245\331\003\276\240\177$>\031\3116>lJ5\276k\'\366\275\202>\224=+/S>\313\365\t=\302+\014\275;\236a<Ak\231\276\370\344\224\276\000=~\275\261\377\230\275r\2105<\371~\245=\276G\263<x\375\304=\303\325j\275\223{\244=\350\375\202=E\317\003\276?\\B\273\273\007\377=\234\016\222<\350B\250\2758E\271\275\342%\277\275\315\330)\276H\351(\273\013\234\227\275\206\037\003>\356r\251\275*\2768\276\324\322\345\275\372\362V>\031\024)>[=&\276\255\223\341=\207\025\335<\312H\201=\255@\334=:\340\245=xY\324\275g\362\211>d\347\326\275)M\323<\224S\351=u<\215\2741Z\343=\363\361+=V\232]>\327\272\336\275\253T\221\275;\313@>\231\377\026\275R\210\273=\367\271l<\2606\025<\357\206\340\274\024\321R=\325\253\t<;\262\264=\034\242Y<\312\347\027>-\246\262\275uk\340\275\006\335\350=\312\224Q>\005\2079\275j?c=\335.l\276e\363\327\275\323!\231=M\005D>:\316\333\274\203\236u\275u\350\212\276\035G~\276\203 \266\2763rh\276\235(\'\276d\212\037\275\321&G>\211\001\245\275\322\2340\276\342\031\244=\363|(\276\031K\352\275\243\337\026\275^\034\026\2766\220<\275\367)#=\273&`>\325\206\t=\250\026\332\273\206}\031:e\361@\274\244\301\016\276\037y\363\275\275\301\206=\235GX<\213\036Q>\216\225h\275\256]D\276\r\311\277\274\374\306\'\2767\307\026\276)\205\227\275\350\250\261\274H\334\312\274{t\257\274\347w\017>x\370?=\306\253\005\275L\'\016\276\rXd=ij\312\275[*\266\275b`\006\276[`\002\2753\230\250\275#\363/>\257\2047\275\215w\026:\217W\210=]\266\370\273\321B\226\276\350\211\010>\032W\371<\223H9=7\302z\274\342\315\343=hn\351\275\013kS\275\336\375s<>r\225\275ip\360\275\254k\342\275\217\313\356\275\213\363\373=\235\206\262\275\326:\004>\341\0318>\\\321\235=H#j<L\273J>\221\230a\275R\"\204\2752\334\212>\2234\024\2764g\3159\036D~\276\202\361]\276h\244\371\275\221l\344=l\262\366\2753\357\201>2\236\364<y\372\257=i\325\350\275V.U\275~\223\243=\363\022\226>\341\322\202\274o\210\353\2756\303\364=\214d\323=\274T\032>\014_\204\276\302\303\374\275\343\316T\275=\231k\276;{\323=,\306\313\275\274\177\001\276\303\204F\276%)\344\275\212\035{\274zwF=\201\327h>\364\307\222\275\270\343\010\276-ej=\354\366\016\276\317\"\035>m\373\227\276\014}\031=\353\026\353;\323\2672\275\301\232\327>\245\303?\276\372\217Y\276:Q\'\273\005\2451>C?\007\276\363\335s=\0356\205\275\335\361\353\275Jq\211=\032\263\262\275u\262O=\241!?;S%@\276\270{\267\274\017\261\211=\223\016\250<\240\234B=\216\222T\274*\253\222=\031G\246<\351\276\300=\037\310\373\275\261!\201\2767\363\002\276g\266\010>#\034\261\275\035\277\335<\264\236,>)\310\300\275\213\355\227\2740\223\350=\330G\315\274N{\353\275\231\314i=\003\354\367\274\004\032\036\275q\215\323;\220H\034<Y_\345=\226\274\025\276\335\234\027>#\177A\276\276\010\303\273\034)G>\0230H>\'\351\274=\367u\200;\232d\214<W\365*=i\022\254\275\366\325\002\275\302\271r:oi\375:\221\311\035\276\222\366_>c\'G<{8\301\274s1m\275Oq\352=\361\2241\275\330\030U\275\204C:;[\373\033\273]\177N>\325\216\032\276\207\000\310\275E\016O\275\241Cr><\200\265\275\3149 \276\2769{>\233E\310<\213\\\205\273\236\313I\276\360\246\252\276Y\331(\276\224iJ=\202\rN\273\"\312\315=F\000\270\275\021\233\200>\260\273h=\r}5\276,\254==\024\317\266\275\256\211\224=\211\306\375=\274:\216\275F\002\245>\272\347\022\275\364\'\371\275;\332K\275\242X\324=\256nu\275*(\305=S\365c\274$\026\242<cj\354=\006o\217=\325\311\372\275\320\226N\276\317\0244\276\276r\366\275Y\311E\276\261x`>\262\0319>\346+\270\275l\352t\276\365\351\331;*c\205\275\344m\004\276\2218+\276\342\312\036\276a\331\323=\227*\t\276>\0221>!=\204<0{\242\275\213?\017\2752\227\\>\327)\241\274\000.\241\275Z\241\370\273v+\026>\324|\017=\351\007\357\275U\033\372=k\370\205\276s\372\226\275\243\213.=\301\236\250\274t{\221\276y\203V=\0326\t\275\277\021\300\275>M\317=\'\024\022>n\274\362\275\363\2625\273\211\345\014\276\346D8=\t;\343\274\201\203 >d\250\217=r\004\014=\274\006\357<\240\330p<My%>\336\235\004>UD\212\275H\274\244;\3520q\276\246p\234=\033Y\230=v]\373<g\023\302=/\247e>\033\242\242=a\274\022\275\240\324\205>\324\321\307=\263\221I>\025\263\024>\273\234s=FY/=/`\\\275\237H-\276J\017\350\275\226i-\276\224\2079\2769\276\302\274`\362\202\275\216\032\273\275\263\220\270=\263i\235<\337\211\030\275l\314\235;\207\032v\276\030\277\"\276T\373\302<J\202\226\276\033R\252=\216\355\320\275\321?Q\275^\014\332;\355*\364=c\275;<\013\231\364\275\242\210\205=c\267\231\275\234\211$>9\261\257>\350|\265\275\216\334\317\275\270\365\240\275\332%\255\275}\003r\275\302@\254\275Z\027\315\271~\036\252<\210k\024\274\221\371\347=I\033\010=~\335\354;\203\323\362\275\317\004\302=1\023~=\246%C\275\266\243\\\276\326\272`\274\320\034}\276\347D\213<\304<\226;\r\211\206\276\307r\232;\003\350\032;?D\241>]\337\251<\225\307\210=\243.\201=\353\236\200>\001\233\306=\202\200V\276N<9>\275M#>\256k\332=\031\335\262=\2409\003\276M\234\243\274\245+\342\275\306\366\226=~\341\204\276\006K\205=\001\273\277\274)\367\035>\003\024\217=\205U\213\2752\210F\276\nX\006=L9\311<j^\020>\361\235\247\275\266z{<v:\007>\004G\r\276\356\221\256\275\' \001\275\352\356\220\275\260\021w\274\036\201\010\276\362\n$\276<\304Q>o0\216=4t\355\275KFu>\271\r\231\275\352t0\275\345\274m=\257\204\223=h\201\236=\303b\034\275+\202E\276drq>.\025\021\276\t\346\036=\277\352\341\274\366\343I\276\006\217\234;\007\244D\276\25442\275\261\020\304=\265\247E\274B\270m>\014uF>XDx=\357j\245\274\275\326\364=\026\205N\274\222\'\325=U#\243\276D\023\214\275\221A\314=\217\241\254\275\023\250\267\276U\337&\275\250\024.<\363\210\014\276 \373\037=\031;\">T\325\r\276\301\000\355\275\271\313D=~z\257\276\207i\r\276\014Zi\275\331F\016\276\356\327\222=r\261\004\276\202\037\024>\201\033\007\276-0\006\276\314\363E\274\231\301\325=\277\375\275=T\342\226\274i\026\356=[n\272:\310!\177>\005\305Y\276A\375x\272je\345\275V\025\351<\364\373\254\275l:\t\276V\363u\275\231d\023\274+\277\237<\365\233\326\275\2108\212\275FV~\275y0k\276\321\323J\276\340\260\036>]\372\311\275\370\221M\274\207K\326\275\313\214\211=R\016\245=\020<7\275\352F\213=\005p;\276\214\237\321=\235\204\030\276|t\371=\354%\355=.tC>\274,\324\2758\202\324=!;\222=\356\355\014\276\334\220:\275gW\t\276\177q\223<\330r\202=H\\\331\275F\345\215\275\342\345\207\275\257\240\357\275\266&y=\237\354\257\275\207\254\230=\264\207L\275-\357\024\276C\005.\275\'fD>U\331s=\021\342\230\276 z\031>!\262\312<\270\204\210\273\023l\201=\223,X>\321\035\223=\300\362?>22\371=\347\026e>\216\026\214\276\016\336\321\275w\356\007>\230y\031>8ha=\032\332k;\326=D>\316\'\207\275\216\225\273<\031bR>[J\360=\210 \363\275\255\227\377\273k\302{>\020K\253=\261\367%=.)\250=\377o\211>\274\202\352\274\271\035{\275\251.\001\275\326+\013\276\017\204\026\276\'y\340\275\306\305\256\275\247\216\373\275\2541\200\276\001Q\302=3]\333=\367\254\330<1\021\021\275\2727\305=\343E >\236\366\214\274\'a\264\275\365\0221\275\202\261O\276\223~\307<N\361\\\275\210\030\371=\371\372\353=M\3731>0c\021\276\213\314\231\275\356\341n\276\035w\305\274\023\212\343=\357#\003>\355\232L>F\206\217=\014\034M>\366\224\213=5\2306\276\315\277\306=\257\243\263=i\225[\273\320M\003\275I\202\035>Z^\027>\364\263\212=\354\032\r>\374d\236>\314\321\227\275\242\246o\275\330=\321=s<\226=\305)\276<\243\017m\275\3030\304=Q\375\r>W\"c\276\n\000\332\275\360T\013=\032\031\337=2\211\370=\317:&\276\2211|\2757\237\332=\331\270\231<7\375\223\275\202\266>>\337r\225\274*-\202\276\271\341\007>b\257\251<\033\316W\275\303f\364=\302\3564=*\034\224=mo\237=8\215\033\276\3602\027>\243\322\227<\3360\214>*\177\023>C\353\254\275\023\032\016<\302\037\265<\t\256\301\2755\304\013\276\234r\361=\330\226\032=hTH\274\356\373[>\031\306\216\275\372[\341\275\354\367$\276\032\345S<\247\200->\034\210g>\260KI\276\200|Y>\346\261\361\275IeF=\317S\204=\300\3617\273\2707\207=E\203\363\2753%\262<\267\254\377\275\266\230\275\275j\244\016>\273\241\004>\231\231\022\275\317\252\216<\200,\363=\224\310D\276\352a\354=\324\263\305\275\227\\/\276\375\2174>,c\035\276\206\351{\274\210q\220\276y\241\022\276]_5\276$\227\222>WH\240\274\036\240i<\373\201\r>\014\252c\275\013\036\301;\221lw;s\223\202\275TM\010>\375\305\362=;\341\273=\272\233\205\276\210\230\034=g\233\337=\223\003k\275|G.>\303|9>1\021\200=C\335\240=9\330\267=\325fc=\261h\212\276U!#\276\004\'{\275&\274C\274l\343\223>\274)\273=\322\331<>\277U\215\274[s]\275G\200.>\373\325\341<\020\303\344\275\000~>=\250\305}\276(\242O\275Hpc\2752O\223\276\353\233\222\275\324\361\004\275\354ZU= \245\207==\'\372=\030@\n\276d\303\373=hi\034\276W\203\214\275Wz;\275X\371\004>S\231#\276\206^&=X\033@\276\310\362\t\275\317\006\316=\200H\236\2755\362\017=f\330\374=\323I/\275\006>n>?\17799qU\252=i1.\276)\263c\274T>\231>\261\024 =H\324\215\275L_N\276\237g\337\274\224\002\263\274\n\177x\276\211f\226=\021f\370\274<\022\t>\223\214\353\2741\251\276\2746*g=\2063\310=\016k4\276\234\367\301<\267\373\007>2BK>\2175$\275\305\303\001>\264c\267<\343\236,\275\371\016\020>\352#A\275\213{\004>\207\274M\275@\317.\275\324\200L=\301\325q\276w D>\342ii=M \370\2751\360\223=\306\321\366:\275,\'\276E\266C\275\254\021\241\2764\316\014\275<vI>A\207\365\274\302cs\273vD\333\275\027\230\210=h\021\223>\004\230o;m1\236\276\372\214W<{e\370=\233\2542\276s6\256\275\257Q\010=\300\250,\276\036\320\236=\366\326\035\276~\317\022=\324>\330\275\243\263\247\274&\217\357=W\2263=\326\271\035\275\301\013\025\276\364)\343=f:M=$\254\246=\246\263S>>\302\002=\204*[\276\037]\364\274\261\302\377\275\031\213J\276\257\205==\273\t$>\315\020\202\275\266\005\330\275\276\'\'>IO\324\272\305\244\276\275\177\020w=8\335I=\256;\004\276\246\032\344=%4@\276\037\236\350\275H\373\312\275\266\333\304\274\205\253)=\020\332\212=\314d\365=\370\313\266=\3334\031>?;\216=a\337\341\275\017\036\250<e\266\017>Q\226B\276;\210\216\275\026\031\206\275\221|O=\251\204f\275u\'\027\275\275>\322\275mu\031\276\367I\212\275\311\322.=w(\244\276\305D_>\031z\004\276\351\000`\275\223\206)\276\024\237\250>\375s\002<\236\207\177=\303\371)>\237\345\023\276\345R\254\275a35\274P\344\261\273\353\201\276<`a+\276\234\214\205\276\035\257\352\275\035k\337\274\312c\362=G\251*= o\001\276M`\377\275\031\305\016>\233\232\243\274\023\004!>r\276%\275\332U<>\345\324.\276\255\2066=&\301T\275\232\024x>\201\330\027>9\364\031\276\313\223:\276\340\214\322<y\302e>P\202\260\2756`L<\272q\210\276G0$>H\366g>\317\355\014\276\240\3109>\211\330\017>\032Q\232\274\360\216\001\276(3e\275\341{2\276\253;\200\275\340:7\276\022\266\036\276\004\177\017=86\304\276[\351\254\275/J\000\276\000\372\377=\371\356\234=\361k[\275cj\307<\312\364{;\002;-<v\346>>\3462\346=\224\2105=\323M]:\217\263<=KU\034\274[C\204\275r\261{\276\026\222[\275\351\310\241\274J\340\021\2767\3222>\316\261\373\275y\217\277=\245\227,=\363\315(\275x\035(\276\260\242\032<*\000\346\275\315\241\357=\341\211\000\276\270\246\206\274\020 \177=\236U\375<\304\370\316<\245\030\035>>\265 \275S_*>\273\225\377\275\001Z\355\275$\255\236\275\225t\r\276\022`4\2755\342\354\275\017\270\271\275EN+\2750\020\257<8*A\275\036Q\265\275f\010\\>A\3025=h\215\030\276\307\227\267\275\017\246\017<1\2401\276{\302\000\276\315v\">\033\221u\275\t\365\031=r\236\030\2739K\333<zGU>w\266\217\275\266n\334\275\nH\307\275\240\214\340\275jY/\276\301q3>[\010Z>:\237x\275\320}\361<\241\2447\276\t\277\222>\n\025\210\276N\270\353\274\233 \244\274-\003E\274c\006\213\275\201\205$\276\036\374>=\201\204 \276w\354\006\276\3726J\276.\222\301:\221\275\377\275\002\021\036>\322\242\300;\246\205\205\275\373 W\276\360^\367\272Ti\224=d\020!>\206a\023>7Y0=\343\345H\275O\022\374\275cF\211>\303\010 >-\007\363\274|.\275=G\241?\276\333F\237\275=}\347\275\242\373\247=\216\032\002=\274\313\327\275\213\223\254\276\343\233\204=\022\352?=>\t\304<\266\005\243>P\273$\274p\372y=\232!\233\275\266V\032\275Z\347\021\276\202\204V=\337?\023>u\223A<\267T\344<\t_Z>0\240\001\275\256|\250\276\377e\346\275l\0309>\341\356\013\276\0304\373\275i\234\302\272q\342^\276\022A\260=`\034\336\275\032\346\356\273\200\253\220\276)\250E\276\013:\253;Uy\004\276b>\201<\354v\020\276\376\265\317=r\3345>s\321\257<{\030\"\276\217\221\365=\023\324\202=V\027\221\275,\030\021>\360\312\267=\003\263\002\276~%|=\376\217\222=\t\311\321\275\\\321\277\275V\263y=\327\255\264=\202$)\276\370\214\225=\032j\305<\t\340n\275\225+\t=\260\262\250=\244\333\325="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/strided_slice_10"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/strided_slice_10"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/strided_slice_10"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/mul/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/mul_1/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_1"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_3"
  input: "net/mul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/TensorArray_1"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "input_ta"
    }
  }
}
node {
  name: "net/TensorArrayUnstack/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/TensorArrayUnstack/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
